# Дан список цветов: ‘red’, ‘green’, ‘white’, ‘black’, ‘pink’, ‘yellow’.
# Создайте еще один список и переместите в него 1-ый, 5-ый и 6-ой элементы.

colors = ['red', 'green', 'white', 'black', 'pink', 'yellow']
pref_colors = []
pref_colors.append(colors[0])
pref_colors.append(colors[4])
pref_colors.append(colors[5])
print(pref_colors)